{
  "SELL": "<p>EDF Blockchain Power Trading Platform Co.,Ltd Power Trading Platform Agreement </p>One.Principles<br/> 1.The term 'user' as used in these Terms refers to the users of the trading platform who fully agree to all the terms of the agreement and complete the registration.<br/> 2. The terms of this agreement should be read carefully before registration.Once registration completed,it means the user fully accepts all the terms of the agreement and agrees to sign this agreement.<br/>Two.Service Content<br/> 1.EDF blockchain power trading platform offers market entity registration,power trading,power settlement,and information release.And the service content is subject to the actual service provided by the trading platform.<br/> 2.EDF blockchain power trading platform reserves the right to change the trading platform requirements and services as necessary,and reserves the right to change,discontinue or terminate the trading platform at any time,with or without prior notice.<br/> 3.The user is equipped with the equipment needed to connect and use the trading platform,and he is responsible for his Internet access expenses.<br/>Three.Usage Rules <br/> 1. Users should obey the rules of the electricity market trading operation and the agreement of this agreement,consciously and self - discipline,and must not manipulate the market price,damage the interests of other market entities,and ensure the transparency of market operations. <br/> 2. The user account information is the only basis for verifying the authenticity of the user.The user is obliged to ensure the security of the user account information.The user should bear full responsibility for any loss or damage caused by all activities carried out by his own account. <br/> Four. Responsibility Statement <br/> 1. The EDF blockchain power trading platform is responsible for the operation and maintenance.However,the platform does not cause service interruption or failure to meet user requirements due to force majeure,computer virus or hacker attack,sudden failure of hardware and software equipment and electronic communication equipment,network service provider line or other failures. <br/> 2. If the user violates national laws and regulations or the terms of this agreement,EDF blockchain power trading platform has the right to stop providing services at any time.And users must bear full legal responsibility for their illegal and breach of contract.In the meanwhile,if the trading platform suffers any damage or suffers from any disputes,litigations and claims from third parties,the user must compensate the total loss. <br/> Five.Privacy <br/> 1.The trading platform does not disclose the user 's private information. <br/> 2. There are many unpredictable factors in the network environment. As long as the trading platform does not actively or intentionally disclose user privacy data,the platform does not bear any related responsibilities. If the user uses the trading platform, the third party will grab or even disclose the information, and the user will bear the risk. <br/> As a power generation user, social responsibility should be fully fulfilled to ensure the normal supply of electricity and a fair and open sale of electricity.<br/> For malicious quotes,the one will receive punitive measures.",
  "BUY": "<p>EDF Blockchain Power Trading Platform Co.,Ltd Power Trading Platform Agreement</p>One.Principles<br/>1.The term 'user' as used in these Terms refers to the users of the trading platform who fully agree to all the terms of the agreement and complete the registration.<br/>2.The terms of this agreement should be read carefully before registration.Once registration completed,it means the user fully accepts all the terms of the agreement and agrees to sign this agreement.<br />Two.Service Content<br/>1.EDF blockchain power trading platform offers market entity registration,power trading,power settlement,and information release. And the service content is subject to the actual service provided by the trading platform.<br/>2.EDF blockchain power trading platform reserves the right to change the trading platform requirements and services as necessary,and reserves the right to change,discontinue or terminate the trading platform at any time, with or without prior notice.<br />3.The user is equipped with the equipment needed to connect and use the trading platform,and he is responsible for his Internet access expenses.<br />Three.Usage Rules<br/>1.Users should obey the rules of the electricity market trading operation and the agreement of this agreement, consciously and self-discipline, and must not manipulate the market price, damage the interests of other market entities, and ensure the transparency of market operations.<br/>2.The user account information is the only basis for verifying the authenticity of the user. The user is obliged to ensure the security of the user account information. The user should bear full responsibility for any loss or damage caused by all activities carried out by his own account.<br />Four.Responsibility Statement<br />1.The EDF blockchain power trading platform is responsible for the operation and maintenance. However, the platform does not cause service interruption or failure to meet user requirements due to force majeure,computer virus or hacker attack,sudden failure of hardware and software equipment and electronic communication equipment, network service provider line or other failures. <br />2.If the user violates national laws and regulations or the terms of this agreement, EDF blockchain power trading platform has the right to stop providing services at any time. And users must bear full legal responsibility for their illegal and breach of contract. In the meanwhile, if the trading platform suffers any damage or suffers from any disputes, litigations and claims from third parties, the user must compensate the total loss.<br/>Five.Privacy<br />1.The trading platform does not disclose the user's private information.<br />2.There are many unpredictable factors in the network environment. As long as the trading platform does not actively or intentionally disclose user privacy data,the platform does not bear any related responsibilities. If the user uses the trading platform, the third party will grab or even disclose the information, and the user will bear the risk.<br />Users who voluntarily participate in the energy trading system should abide by the corresponding power requirements. After signing the agreement,they should also actively participate in energy management activities to reduce their own electricity costs."
}
